---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadMark
source: html/800b3a9e-011a-07a2-13d3-98e40e4f68cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTriserTreadMark Property

"Tread Mark": (OBSOLETE)

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTriserTreadMark { get; }
```